esmende1/ultrafillRE/resources/msp430f155.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SUPPLY_VOLTAGE_SUPERVISOR</name>
      <description>Supply Voltage Supervisor</description>
      <baseAddress>84</baseAddress>
      <registers>
        <register>
          <name>SVSCTL</name>
          <description>SVS Control</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>SVSFG</name>
              <description>SVS Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSOP</name>
              <description>SVS output (read only)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSON</name>
              <description>Switches the SVS on/off</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORON</name>
              <description>Enable POR Generation if Low Voltage</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLD0</name>
              <description>VLD0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLD1</name>
              <description>VLD1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLD2</name>
              <description>VLD2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLD3</name>
              <description>VLD3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSTEM_CLOCK</name>
      <description>System Clock</description>
      <baseAddress>86</baseAddress>
      <registers>
        <register>
          <name>DCOCTL</name>
          <description>DCO Clock Frequency Control</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>MOD0</name>
              <description>Modulation Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD1</name>
              <description>Modulation Bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD2</name>
              <description>Modulation Bit 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD3</name>
              <description>Modulation Bit 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD4</name>
              <description>Modulation Bit 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO0</name>
              <description>DCO Select Bit 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO1</name>
              <description>DCO Select Bit 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO2</name>
              <description>DCO Select Bit 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCSCTL1</name>
          <description>Basic Clock System Control 1</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>RSEL0</name>
              <description>Range Select Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSEL1</name>
              <description>Range Select Bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSEL2</name>
              <description>Range Select Bit 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT5V</name>
              <description>XT5V should always be reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVA</name>
              <description>ACLK Divider 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVA_0</name>
                  <description>ACLK Divider 0: /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_1</name>
                  <description>ACLK Divider 1: /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_2</name>
                  <description>ACLK Divider 2: /4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_3</name>
                  <description>ACLK Divider 3: /8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTS</name>
              <description>LFXTCLK 0:Low Freq. / 1: High Freq.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT2OFF</name>
              <description>Enable XT2CLK</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCSCTL2</name>
          <description>Basic Clock System Control 2</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>DCOR</name>
              <description>Enable External Resistor : 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVS</name>
              <description>SMCLK Divider 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVS_0</name>
                  <description>SMCLK Divider 0: /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_1</name>
                  <description>SMCLK Divider 1: /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_2</name>
                  <description>SMCLK Divider 2: /4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_3</name>
                  <description>SMCLK Divider 3: /8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELS</name>
              <description>SMCLK Source Select 0:DCOCLK / 1:XT2CLK/LFXTCLK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVM</name>
              <description>MCLK Divider 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVM_0</name>
                  <description>MCLK Divider 0: /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_1</name>
                  <description>MCLK Divider 1: /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_2</name>
                  <description>MCLK Divider 2: /4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_3</name>
                  <description>MCLK Divider 3: /8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELM</name>
              <description>MCLK Source Select 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELM_0</name>
                  <description>MCLK Source Select 0: DCOCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_1</name>
                  <description>MCLK Source Select 1: DCOCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_2</name>
                  <description>MCLK Source Select 2: XT2CLK/LFXTCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_3</name>
                  <description>MCLK Source Select 3: LFXTCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
