esmende1/ultrafillRE/resources/msp430f155.svd
        <register>
          <name>ADC12MCTL9</name>
          <description>ADC12 Memory Control 9</description>
          <addressOffset>9</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>INCH</name>
              <description>ADC12 Input Channel Select Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCH_0</name>
                  <description>ADC12 Input Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_1</name>
                  <description>ADC12 Input Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_2</name>
                  <description>ADC12 Input Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_3</name>
                  <description>ADC12 Input Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_4</name>
                  <description>ADC12 Input Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_5</name>
                  <description>ADC12 Input Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_6</name>
                  <description>ADC12 Input Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_7</name>
                  <description>ADC12 Input Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_8</name>
                  <description>ADC12 Input Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_9</name>
                  <description>ADC12 Input Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_10</name>
                  <description>ADC12 Input Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_11</name>
                  <description>ADC12 Input Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_12</name>
                  <description>ADC12 Input Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_13</name>
                  <description>ADC12 Input Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_14</name>
                  <description>ADC12 Input Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_15</name>
                  <description>ADC12 Input Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SREF</name>
              <description>ADC12 Select Reference Bit 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SREF_0</name>
                  <description>ADC12 Select Reference 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_1</name>
                  <description>ADC12 Select Reference 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_2</name>
                  <description>ADC12 Select Reference 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_3</name>
                  <description>ADC12 Select Reference 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_4</name>
                  <description>ADC12 Select Reference 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_5</name>
                  <description>ADC12 Select Reference 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_6</name>
                  <description>ADC12 Select Reference 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_7</name>
                  <description>ADC12 Select Reference 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOS</name>
              <description>ADC12 End of Sequence</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC12MCTL10</name>
          <description>ADC12 Memory Control 10</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>INCH</name>
              <description>ADC12 Input Channel Select Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCH_0</name>
                  <description>ADC12 Input Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_1</name>
                  <description>ADC12 Input Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_2</name>
                  <description>ADC12 Input Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_3</name>
                  <description>ADC12 Input Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_4</name>
                  <description>ADC12 Input Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_5</name>
                  <description>ADC12 Input Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_6</name>
                  <description>ADC12 Input Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_7</name>
                  <description>ADC12 Input Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_8</name>
                  <description>ADC12 Input Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_9</name>
                  <description>ADC12 Input Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_10</name>
                  <description>ADC12 Input Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_11</name>
                  <description>ADC12 Input Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_12</name>
                  <description>ADC12 Input Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_13</name>
                  <description>ADC12 Input Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_14</name>
                  <description>ADC12 Input Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_15</name>
                  <description>ADC12 Input Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SREF</name>
              <description>ADC12 Select Reference Bit 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SREF_0</name>
                  <description>ADC12 Select Reference 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_1</name>
                  <description>ADC12 Select Reference 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_2</name>
                  <description>ADC12 Select Reference 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_3</name>
                  <description>ADC12 Select Reference 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_4</name>
                  <description>ADC12 Select Reference 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_5</name>
                  <description>ADC12 Select Reference 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_6</name>
                  <description>ADC12 Select Reference 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_7</name>
                  <description>ADC12 Select Reference 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOS</name>
              <description>ADC12 End of Sequence</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC12MCTL11</name>
          <description>ADC12 Memory Control 11</description>
          <addressOffset>11</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>INCH</name>
              <description>ADC12 Input Channel Select Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCH_0</name>
                  <description>ADC12 Input Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_1</name>
                  <description>ADC12 Input Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_2</name>
                  <description>ADC12 Input Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_3</name>
                  <description>ADC12 Input Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_4</name>
                  <description>ADC12 Input Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_5</name>
                  <description>ADC12 Input Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_6</name>
                  <description>ADC12 Input Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_7</name>
                  <description>ADC12 Input Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_8</name>
                  <description>ADC12 Input Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_9</name>
                  <description>ADC12 Input Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_10</name>
                  <description>ADC12 Input Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_11</name>
                  <description>ADC12 Input Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_12</name>
                  <description>ADC12 Input Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_13</name>
                  <description>ADC12 Input Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_14</name>
                  <description>ADC12 Input Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_15</name>
                  <description>ADC12 Input Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SREF</name>
              <description>ADC12 Select Reference Bit 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SREF_0</name>
                  <description>ADC12 Select Reference 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_1</name>
                  <description>ADC12 Select Reference 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_2</name>
                  <description>ADC12 Select Reference 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_3</name>
                  <description>ADC12 Select Reference 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_4</name>
                  <description>ADC12 Select Reference 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_5</name>
                  <description>ADC12 Select Reference 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_6</name>
                  <description>ADC12 Select Reference 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_7</name>
                  <description>ADC12 Select Reference 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOS</name>
              <description>ADC12 End of Sequence</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
