esmende1/ultrafillRE/resources/msp430f155.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC12</name>
      <description>DAC12</description>
      <baseAddress>448</baseAddress>
      <registers>
        <register>
          <name>DAC12_0CTL</name>
          <description>DAC12_0 Control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DAC12GRP</name>
              <description>DAC12 group</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12ENC</name>
              <description>DAC12 enable conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12IFG</name>
              <description>DAC12 interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12IE</name>
              <description>DAC12 interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12DF</name>
              <description>DAC12 data format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12AMP</name>
              <description>DAC12 amplifier bit 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC12AMP_0</name>
                  <description>DAC12 amplifier 0: off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_1</name>
                  <description>DAC12 amplifier 1: off</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_2</name>
                  <description>DAC12 amplifier 2: low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_3</name>
                  <description>DAC12 amplifier 3: low</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_4</name>
                  <description>DAC12 amplifier 4: low</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_5</name>
                  <description>DAC12 amplifier 5: medium</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_6</name>
                  <description>DAC12 amplifier 6: medium</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_7</name>
                  <description>DAC12 amplifier 7: high</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC12IR</name>
              <description>DAC12 input reference and output range</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12CALON</name>
              <description>DAC12 calibration</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12LSEL</name>
              <description>DAC12 load select bit 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC12LSEL_0</name>
                  <description>DAC12 load select 0: direct</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12LSEL_1</name>
                  <description>DAC12 load select 1: latched with DAT</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12LSEL_2</name>
                  <description>DAC12 load select 2: latched with pos. Timer_A3.OUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12LSEL_3</name>
                  <description>DAC12 load select 3: latched with pos. Timer_B7.OUT1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC12RES</name>
              <description>DAC12 resolution</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12SREF</name>
              <description>DAC12 reference bit 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC12SREF_0</name>
                  <description>DAC12 reference 0: Vref+</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12SREF_1</name>
                  <description>DAC12 reference 1: Vref+</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12SREF_2</name>
                  <description>DAC12 reference 2: Veref+</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12SREF_3</name>
                  <description>DAC12 reference 3: Veref+</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC12_1CTL</name>
          <description>DAC12_1 Control</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DAC12GRP</name>
              <description>DAC12 group</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12ENC</name>
              <description>DAC12 enable conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12IFG</name>
              <description>DAC12 interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12IE</name>
              <description>DAC12 interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12DF</name>
              <description>DAC12 data format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12AMP</name>
              <description>DAC12 amplifier bit 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC12AMP_0</name>
                  <description>DAC12 amplifier 0: off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_1</name>
                  <description>DAC12 amplifier 1: off</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_2</name>
                  <description>DAC12 amplifier 2: low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_3</name>
                  <description>DAC12 amplifier 3: low</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_4</name>
                  <description>DAC12 amplifier 4: low</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_5</name>
                  <description>DAC12 amplifier 5: medium</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_6</name>
                  <description>DAC12 amplifier 6: medium</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12AMP_7</name>
                  <description>DAC12 amplifier 7: high</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC12IR</name>
              <description>DAC12 input reference and output range</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12CALON</name>
              <description>DAC12 calibration</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12LSEL</name>
              <description>DAC12 load select bit 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC12LSEL_0</name>
                  <description>DAC12 load select 0: direct</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12LSEL_1</name>
                  <description>DAC12 load select 1: latched with DAT</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12LSEL_2</name>
                  <description>DAC12 load select 2: latched with pos. Timer_A3.OUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12LSEL_3</name>
                  <description>DAC12 load select 3: latched with pos. Timer_B7.OUT1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC12RES</name>
              <description>DAC12 resolution</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC12SREF</name>
              <description>DAC12 reference bit 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC12SREF_0</name>
                  <description>DAC12 reference 0: Vref+</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12SREF_1</name>
                  <description>DAC12 reference 1: Vref+</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12SREF_2</name>
                  <description>DAC12 reference 2: Veref+</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC12SREF_3</name>
                  <description>DAC12 reference 3: Veref+</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC12_0DAT</name>
          <description>DAC12_0 Data</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>DAC12_1DAT</name>
          <description>DAC12_1 Data</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
