esmende1/ultrafillRE/resources/msp430f155.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65504</baseAddress>
      <interrupt>
        <name>DACDMA</name>
        <description>0xFFE0 DAC/DMA</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFE2 Port 2</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFE8 Port 1</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>TIMERA1</name>
        <description>0xFFEA Timer A CC1-2, TA</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>TIMERA0</name>
        <description>0xFFEC Timer A CC0</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>ADC12</name>
        <description>0xFFEE ADC</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>USART0TX</name>
        <description>0xFFF0 USART 0 Transmit</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>USART0RX</name>
        <description>0xFFF2 USART 0 Receive</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFF4 Watchdog Timer</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>COMPARATORA</name>
        <description>0xFFF6 Comparator A</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>TIMERB1</name>
        <description>0xFFF8 Timer B CC1-2, TB</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TIMERB0</name>
        <description>0xFFFA Timer B CC0</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>NMI</name>
        <description>0xFFFC Non-maskable</description>
        <value>14</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>